use blitzortung::live::Strike;
use criterion::{black_box, criterion_group, criterion_main, Criterion};

const CIPHERTEXT: &str = "{\"time\":165360ċ02čČ950ĕ,\"latĆ38.7Ċ126ėlonĆĞ932Ġ1ėalě:0ėpolĆĵ\"mdsĆ14728ėmcgŀ97ėstĚuĿĴėregiħŀōiŉ:[ĀŎaĆēįāăą:43181ďĥĚĆ45.ńī6ŅĘř:21.ī396Ĥ\"ıĳģ4ōŏtőŀ0},ŠŏĆ235ŹĂĄŲ3ċŮŌĘű:Ĕŵ157ĠĥŻĢ.1ī2ƂİĲĆ6īƊŐŒĢƐƒŢżĠƟƙŨŪ6408Ɵęĳ42ſǅĐ3ƩĨż3.ĊġŹƆĩƯƶƌƸ2ƺ\"šƎ59ėǀƛ80ƥ2Űǉ7.ƃǃūǐŊǯĔ6ĭƱĳĢǤǠƋƍćƏƑǽƼńǄǥŧǧƃ25ǬĜǮĝč7ǼĦǑ-6.ǩǅǆǹƔĻšǜŀǞȂǡȀǸŦƚũǊƭ5ƄǈĆƣďĈųǳć4.41Ů8ƉƅƲǒǼȟǿŮǟȤƯƕȇȨ4Ū17ŸȍũǮĐŃȭŻĐȷ8Ɯ4Ǽǘ:ƵȃȠćȢƻĩ9ƘȈȩĉĝǫƠĳƣ348ĉɔǑȶ2Ū9ȳȽǺĝǛǿɢȃƔȹǏȧǁɰ06Ůɏƣ6ĝ3ʇȴŴ82ʓ6ƟɜūƄɁǝɄƓƽ4ƄǦȩŭēȭơɰƬƜʎťȔĆ-ž5ǂȌɺŲȼʚŲʜȄʇƿɧɊɘǃʥɭ0.ƁʈȒȴȶǊ90ʖȾ1ɯɽʛȣʝƯȬɈʅ9Ģɚʊ˂Ǩ5ˎŹʬ:ǮȬ37țʳɡťʶɡʸƳ7ȼʡų0Ǆċ˛ğ7ʫŻȗʎ7ċɛȾʓʵǾƸȁɣżĉ˰ʼ˞0Ȭˀȯ˂5̑ŋǇƪǓĈʓ˧ɜƗʃ˫ƹ˒Ƽɥɦɉ5ģʎʲȮũ9ſ8ɥȸȴƥǯƥĉˌƇ˞ːƎ˭ż˞̢ǁ̑ĕȆɬ̏˃ďḑ̌ŻǓʇĊ˳Ȝ:ʌ̷ˬ̟ŊɼʄŲ̑˲ˠơƣɸɍƃ̯ž09ƕʈ͌ĭ˪̃ȡ̹ȋ˚͔ũ̑ȒƖɏʟ.ɱ˽ʕȴŽǔʎǰ͌ŋ͏̞̆Ł̀˱Ʀđ͘ˁğȸʍˇͳʎɚ˿ĳ8ʲ̝ɿȤ̬̣̉˘ʰɫ̨ȰŮĈɳŀȗɶł˯͌˾;̅ʀ̇ǅ˖͕͡ʕȼ̨ȸǯēǩȓɕȶ˽˘̙ˍ˯ʙͧ͐΀̬Ǽ΃ēȬȓʦĞɍ˥ͶźǑƭƬǄģťʗƴ;ΔʝŁĉέͭƂĈǇ͙˂ɥ˦Ȧˡ˻ƥʇǗˍȹϗ̹ĢƁϜųɥƭΛϡͳŮʟʃˡȶΙϣ͌ĔΨϮǪϱČƗǩʊ͟ǩƧʐǌĈˋ͌ɹ˫ϘȄČť˱ʌɰł˶ȻʎƜ΋Ήɶʲɜ˘͏4ͩȋʠʼĉŬŽЈŵ9ˊƦȴ̪łǊ˥͌ŬͦƷʷ͑ć̼ŲƃŬЀ́:˥ȷčЭώƔϼŬ8ɱиĬ;ͩ˘Щɉʕʇύ̨ц˴ͥͷьюɸѐ̜πЦнɶˊЄ̡ȋͱǋųʒůъżϼ˥ƞАɌХ̹аΗǁ˸ɌЋф˞ч˦˕ѱɑǅȹϪɻѣлż̹ɱѕѼʓ̑ʫ͙žʎ̯ͪǋјύɜŮȞπГţĢϱŃ̻α϶ɰˎ̯͡ŴƂƯϔȾĔɀҠϮƦпɐʰΞЛƴ̛̯ι̍ɘΦϬɟǿѥ΀сҤʈƴĻΜҖʕɸϺƪǋċų҄ҝʎѸнϸτʼΑŁĊЮʌɯ͋ѱŴȬŮͽ˨ѷӄŒҡоǲͬɰ7ˋŬͱ̖Ģ˸ӑȕǮʟ̌ɇ˨ʽә̆ɶΥӱǆųщβ̪͠ϳ͆Ǒɖĭɘ˵˨ӳҟҌӆΪǻɫ˱ǆƧ̀Ӎ͹łяѱˈȸғ͌οҌӮЎҐŲǆɥ̤Ю˘ɯӁѱ̪Ɩ˸Ҝ̀ёӬʷ]ėdeęyƳƬ}";

pub fn criterion_benchmark(c: &mut Criterion) {
    c.bench_function("decode msg", |b| {
        b.iter(|| black_box(CIPHERTEXT).parse::<Strike>())
    });
}

criterion_group!(benches, criterion_benchmark);
criterion_main!(benches);
